app/controllers/students_controller.rb

INSERT INTO "students" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2019-07-22 19:44:59.372580"], ["updated_at", "2019-07-22 19:44:59.372580"]]
---
  def create
    @student = Student.new
    @student.first_name = params[:first_name]
    @student.last_name = params[:last_name]
    @student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", nil], ["last_name", nil], ["updated_at", "2019-07-22 21:14:34.738636"], ["id", 6]]
---
  def update
      @student = Student.find(params[:id])
      @student.update(first_name: params[:first_name], last_name: params[:last_name])